{
  "backend/main.mo": "Defines the Product type and provides functions to add, query, filter, sort, and group products in a Map-based store.",
  "backend/migration.mo": "Clones the existing products map and inserts additional predefined products for migration to the new actor version.",
  "feature_evidence.json": "Feature evidence report linking product image rendering requirements to the ProductCard component and associated test coverage.",
  "frontend-file-summaries.txt": "Contains prewritten short summaries for all frontend files used in the project.",
  "frontend/.env": "Defines environment variables for the app name and slug used in branding.",
  "frontend/index.css": "Sets global Tailwind and OKLCH theme variables for light and dark modes, including green and yellow brand colors.",
  "frontend/index.html": "HTML entry point setting the page title, meta description, root element, and script loader for the React app.",
  "frontend/src/App.tsx": "Main React app that fetches products, groups them by brand, and renders hero, brand sections, about section, and fallback UI states.",
  "frontend/src/components/AboutSection.tsx": "Displays an about section with branding text, feature highlights, and informational content.",
  "frontend/src/components/BrandSection.tsx": "Renders a section header and product grid for a specific brand using ProductCard components.",
  "frontend/src/components/BrandsSection.tsx": "Shows informational cards describing the Turtle Wax and 3M brands with icons and themed styling.",
  "frontend/src/components/EmptyState.tsx": "Reusable component displaying an alert-based empty or error state message.",
  "frontend/src/components/HomeHero.tsx": "Hero banner with headline text, description, and a large themed image with decorative gradients.",
  "frontend/src/components/ProductCard.tsx": "Displays a product card with image fallback, name, description, and tags using Tailwind styling.",
  "frontend/src/components/SiteFooter.tsx": "Renders a footer showing branding info and a referral link with dynamic year and hostname.",
  "frontend/src/components/SiteHeader.tsx": "Implements a responsive header with branding, smooth-scroll navigation, and a toggleable mobile menu.",
  "frontend/src/config/branding.ts": "Defines app-wide branding constants including name, slug, and tagline from environment variables.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the authenticated or anonymous backend actor, refreshing dependent queries on identity change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handling identity loading, login, logout, and status tracking.",
  "frontend/src/hooks/useProducts.ts": "Fetches product data from the backend actor using React Query once the actor is ready.",
  "frontend/src/index.css": "Defines Tailwind layers and OKLCH-based color theme variables for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, utilities, and theme extensions using app CSS variables.",
  "project_state.json": "Stores the project’s state, including version info, branding decisions, design notes, and a list of existing implemented features with requirement mappings."
}