{
  "backend/main.mo": "Motoko canister defining a Product type with CRUD-style queries and utilities for sorting and grouping products by brand.",
  "feature_evidence.json": "Feature evidence report linking theme‑related updates to specific frontend files and components.",
  "frontend-file-summaries.txt": "Reference file containing short summaries for key frontend components, hooks, styles, and config modules.",
  "frontend/.env": "Environment variables defining app name and slug for branding.",
  "frontend/index.css": "Global Tailwind base styles and OKLCH theme variables for the Turtle Wax‑inspired color palette.",
  "frontend/index.html": "Root HTML document setting page metadata and loading the React entrypoint.",
  "frontend/src/App.tsx": "Main React app that sets the title, loads products, groups them by brand, and renders themed sections.",
  "frontend/src/components/AboutSection.tsx": "About section presenting branding info and feature highlights with themed icons and text.",
  "frontend/src/components/BrandSection.tsx": "Displays a brand header and a grid of ProductCard components for that brand.",
  "frontend/src/components/BrandsSection.tsx": "Static section describing Turtle Wax and 3M with themed cards and icons.",
  "frontend/src/components/EmptyState.tsx": "Reusable alert component for error and no‑data states.",
  "frontend/src/components/HomeHero.tsx": "Hero section with headline, description, and themed image banner.",
  "frontend/src/components/ProductCard.tsx": "Card component showing product image, name, description, and tags with hover styling.",
  "frontend/src/components/SiteFooter.tsx": "Renders the site footer with current year, branding name, and a referral link including hostname-based tracking.",
  "frontend/src/components/SiteHeader.tsx": "Provides a sticky header with logo, branding, and smooth-scroll navigation for desktop and mobile menus.",
  "frontend/src/config/branding.ts": "Exports centralized branding values such as app name, slug, and tagline from environment variables.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user’s identity and refreshes related queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity auth context with login, logout, and stored identity restoration logic.",
  "frontend/src/hooks/useProducts.ts": "Fetches product data from the backend actor using React Query.",
  "frontend/src/index.css": "Defines global Tailwind styles and a green-yellow themed design using CSS variables for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, fonts, animations, and plugins aligned with the project’s theme.",
  "project_state.json": "Stores project metadata, feature history, and architectural notes for the car care products site."
}