{
  "backend/main.mo": "Motoko canister storing products in a map with CRUD-like queries and helpers for sorting and grouping by brand.",
  "feature_evidence.json": "Feature evidence report listing branding‑related changes, affected frontend files, and associated test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each major frontend file and component.",
  "frontend/.env": "Defines environment variables for the app name and slug used in centralized branding.",
  "frontend/index.css": "Tailwind base styles and OKLCH color tokens defining light/dark themes and layout primitives.",
  "frontend/index.html": "HTML entry point setting the TorqueShine Supply title and metadata and mounting the React app.",
  "frontend/src/App.tsx": "Root React component orchestrating layout, setting document title, and rendering product sections based on backend data.",
  "frontend/src/components/AboutSection.tsx": "Shows an about section using centralized branding with descriptive text and feature highlights.",
  "frontend/src/components/BrandSection.tsx": "Renders a header and product grid for a specific brand using ProductCard components.",
  "frontend/src/components/BrandsSection.tsx": "Displays informational cards describing featured brands Turtle Wax and 3M.",
  "frontend/src/components/EmptyState.tsx": "Reusable alert component for displaying errors or empty product states.",
  "frontend/src/components/HomeHero.tsx": "Hero banner with headline, description, and a styled image introducing the product catalog.",
  "frontend/src/components/ProductCard.tsx": "Displays a product card with image, name, short description, and tag badges.",
  "frontend/src/components/SiteFooter.tsx": "Renders the site footer with dynamic year, branding text, and a caffeine.ai link.",
  "frontend/src/components/SiteHeader.tsx": "Provides a sticky header with branding and responsive navigation including mobile menu handling.",
  "frontend/src/config/branding.ts": "Defines centralized branding values including app name, slug, and tagline.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on the current Internet Identity, refreshing queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity context and provider for authentication, login, and identity management.",
  "frontend/src/hooks/useProducts.ts": "Fetches product data from the backend actor using React Query.",
  "frontend/src/index.css": "Defines Tailwind base styles and a custom color theme using OKLCH variables for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, colors, fonts, containers, and animations.",
  "project_state.json": "Stores project metadata, implemented features, and requirements tracking info."
}