{
  "backend/main.mo": "Motoko backend actor handling user profiles and product CRUD with permission checks and ownership validation.",
  "feature_evidence.json": "Feature evidence report mapping features to related frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Collection of prewritten summaries describing the purpose of key frontend files in the project.",
  "frontend/.env": "Local development environment variables for branding, network, and backend canister ID.",
  "frontend/.env.production": "Production environment variables for branding, IC network, and backend canister ID.",
  "frontend/DEPLOYMENT.md": "Deployment guide explaining local and Internet Computer mainnet setup and requirements.",
  "frontend/index.css": "Global Tailwind-based stylesheet defining color tokens, themes, and base styling.",
  "frontend/index.html": "Root HTML file bootstrapping the frontend app with metadata and main script entry.",
  "frontend/src/App.tsx": "Main React app configuring routes, layout, headers, footers, and query client setup.",
  "frontend/src/components/AboutSection.tsx": "About section presenting branding, product qualities, and informational content.",
  "frontend/src/components/BrandSection.tsx": "Component that renders a brand header and grid of product cards for that brand.",
  "frontend/src/components/BrandsSection.tsx": "Displays a section highlighting featured automotive brands with styled cards for Turtle Wax and 3M.",
  "frontend/src/components/ChangeRequestPanel.tsx": "Provides a dialog for submitting, viewing, and deleting locally stored change requests with timestamps.",
  "frontend/src/components/EmptyState.tsx": "Renders an alert-based empty state message with optional action button.",
  "frontend/src/components/HomeHero.tsx": "Shows the homepage hero section with marketing text and a large banner image.",
  "frontend/src/components/ProductCard.tsx": "Displays a product card with image, pricing, wishlist and cart actions, and navigation to the product page.",
  "frontend/src/components/SiteFooter.tsx": "Renders the site footer with branding, copyright, and a link to caffeine.ai.",
  "frontend/src/components/SiteHeader.tsx": "Implements the main site header with navigation, logo, cart and wishlist indicators, and mobile menu behavior.",
  "frontend/src/config/branding.ts": "Defines app branding defaults including name, slug, and tagline.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refetching queries when identity changes.",
  "frontend/src/hooks/useCart.ts": "Manages cart state in local storage with functions to add, update, remove items, and compute totals.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication using AuthClient, handling login, logout, and stored identity restoration.",
  "frontend/src/hooks/useLocalStorageState.ts": "Custom hook that syncs a React state value with localStorage, supporting initialization and updates.",
  "frontend/src/hooks/useProduct.ts": "Fetches a single product by ID using an actor and react-query, enabled once the actor is ready.",
  "frontend/src/hooks/useProductMutations.ts": "Defines create, update, and delete product mutations using actor methods and invalidates product queries on success.",
  "frontend/src/hooks/useProducts.ts": "Fetches all products from the backend using react-query once the actor is available.",
  "frontend/src/hooks/useWishlist.ts": "Manages wishlist state in localStorage with helpers to toggle, remove, count, and check products.",
  "frontend/src/index.css": "Tailwind CSS setup defining theme variables, dark mode styles, and base typography rules.",
  "frontend/src/lib/pricing.ts": "Provides formatting for INR currency and calculates discount percentages between MRP and sale price.",
  "frontend/src/lib/productImages.ts": "Maps known product brand/name pairs to static image paths and provides a lookup helper.",
  "frontend/src/lib/resolveProductImage.ts": "Resolves the best image source for a product using explicit paths, mapped images, or a fallback placeholder.",
  "frontend/src/lib/uploadedProductImages.ts": "Lists uploaded product images with utilities to retrieve paths and check if a path is uploaded.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AllProductsPage.tsx": "Displays all products with loading, error, and empty states, rendering each product via ProductCard.",
  "frontend/src/pages/CartPage.tsx": "Renders the shopping cart with quantity controls, product images, totals, and checkout navigation.",
  "frontend/src/pages/CheckoutPage.tsx": "Checkout page handling single-product or cart purchases, form validation, order placement, and address/payment inputs.",
  "frontend/src/pages/HomePage.tsx": "Home page showing hero, brand sections, and product listings with loading and error states.",
  "frontend/src/pages/MyProductsPage.tsx": "Admin-style page for creating, editing, and deleting products, including image selection and form dialogs.",
  "frontend/src/pages/ProductDetailsPage.tsx": "Product detail view with image, pricing, wishlist, cart actions, and buy-now navigation.",
  "frontend/src/pages/WishlistPage.tsx": "Displays saved wishlist items with options to view, move to cart, or remove them.",
  "frontend/src/utils/urlParams.ts": "Utility for reading, persisting, and clearing URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/tailwind.config.js": "Tailwind config extending typography, container queries, animations, custom colors, fonts, and themes with plugins enabled.",
  "project_state.json": "Project state metadata tracking features, schema version, and existing feature definitions for Urban Wax Studio."
}