{
  "backend/main.mo": "Motoko actor implementing access‑controlled user profiles and CRUD operations for products with ownership checks and migration support.",
  "backend/migration.mo": "Migration module converting old product records to the new schema by adding an anonymous owner field.",
  "feature_evidence.json": "Feature evidence report mapping features to associated files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Collection of auto‑generated summaries describing the purpose of each frontend file.",
  "frontend/.env": "Local development environment variables defining app name, slug, local network, and backend canister ID placeholder.",
  "frontend/.env.production": "Production environment variables for IC deployment including app branding, IC network target, and canister ID placeholder.",
  "frontend/DEPLOYMENT.md": "Deployment guide explaining prerequisites and steps for local and mainnet deployment of the app.",
  "frontend/index.css": "Global Tailwind-based OKLCH theme variables defining colors and styles for light and dark modes.",
  "frontend/index.html": "HTML entry point loading the React app with title and meta description for car care products.",
  "frontend/src/App.tsx": "Main React app configuring TanStack Router routes, layout, and React Query provider.",
  "frontend/src/components/AboutSection.tsx": "About section component describing the brand with icons, feature highlights, and additional info.",
  "frontend/src/components/BrandSection.tsx": "Renders a brand header and grid of ProductCard components for a given brand.",
  "frontend/src/components/BrandsSection.tsx": "Renders a section showcasing featured automotive brands with descriptive cards for Turtle Wax and 3M.",
  "frontend/src/components/EmptyState.tsx": "Displays a centered alert-style empty state with title, description, and optional action button.",
  "frontend/src/components/HomeHero.tsx": "Provides the homepage hero with marketing text and a large banner image for car care products.",
  "frontend/src/components/ProductCard.tsx": "Shows a product card with image, pricing, wishlist and cart interactions, and navigation to product detail.",
  "frontend/src/components/SiteFooter.tsx": "Renders the app footer with branding, copyright, and a link to caffeine.ai.",
  "frontend/src/components/SiteHeader.tsx": "Implements the site header with logo, navigation, mobile menu, and cart/wishlist counters.",
  "frontend/src/config/branding.ts": "Exports centralized branding values including app name, slug, and tagline.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's Internet Identity and refreshes dependent queries.",
  "frontend/src/hooks/useCart.ts": "Provides cart state with add, update, remove, clear, and total calculation utilities stored in localStorage.",
  "frontend/src/hooks/useInternetIdentity.ts": "Handles Internet Identity auth lifecycle, exposing login, logout, identity, and status via context.",
  "frontend/src/hooks/useLocalStorageState.ts": "Hook for syncing React state to localStorage with safe read/write behavior.",
  "frontend/src/hooks/useProduct.ts": "Fetches a single product by ID using react-query and the actor API.",
  "frontend/src/hooks/useProductMutations.ts": "Provides create, update, and delete product mutations with react-query and actor API, invalidating product queries on success.",
  "frontend/src/hooks/useProducts.ts": "Fetches all products using react-query and the actor API.",
  "frontend/src/hooks/useWishlist.ts": "Manages wishlist items in localStorage with add, remove, toggle, and count helpers.",
  "frontend/src/index.css": "Defines Tailwind base styles and a custom green-yellow theme with light and dark mode variables.",
  "frontend/src/lib/pricing.ts": "Utilities for formatting INR amounts and computing discount percentages.",
  "frontend/src/lib/productImages.ts": "Maps known product brand/name pairs to static image paths and provides a lookup function.",
  "frontend/src/lib/uploadedProductImages.ts": "Stores uploaded product image metadata and helpers to list and validate image paths.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and InternetIdentity providers and loads global styles.",
  "frontend/src/pages/AllProductsPage.tsx": "Displays all products with loading, error, and empty states, rendering a grid of ProductCards.",
  "frontend/src/pages/CartPage.tsx": "Shows cart items with quantity controls, totals, and checkout navigation.",
  "frontend/src/pages/CheckoutPage.tsx": "Handles checkout for single or cart mode with form validation, totals, and order placement.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage, loading products, grouping them by brand, and displaying hero, brand, and about sections with loading and error states.",
  "frontend/src/pages/MyProductsPage.tsx": "Provides an authenticated interface to create, edit, and delete products using form dialogs, validation, and product mutations.",
  "frontend/src/pages/ProductDetailsPage.tsx": "Displays detailed product info with dynamic image handling, wishlist/cart actions, and loading/error states.",
  "frontend/src/pages/WishlistPage.tsx": "Shows wishlist items with options to view details, move items to cart, or remove them, handling empty states and image fallbacks.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL and session-based parameters, including hash-routing support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending fonts, colors, containers, animations, and plugins for styling across the app.",
  "project_state.json": "Tracks project metadata, existing features, and state information for the Urban Wax Studio project. Contains versioning, deployment-related features, and configuration settings for build planning."
}