{
  "backend/main.mo": "Motoko canister implementing access-controlled CRUD operations for products stored in a map with public query endpoints.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to affected frontend files, components, and test references.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend files including components, pages, and utilities.",
  "frontend/.env": "Environment variables defining the app name and slug for branding.",
  "frontend/index.css": "Global Tailwind-based styles defining theme variables and light/dark mode tokens.",
  "frontend/index.html": "HTML entry point bootstrapping the React app with metadata for title and description.",
  "frontend/src/App.tsx": "Main React app configuring TanStack Router routes, global layout, and React Query provider.",
  "frontend/src/components/AboutSection.tsx": "About section component displaying branding info and feature highlights.",
  "frontend/src/components/BrandSection.tsx": "Brand-specific product grid component rendering a header and product cards.",
  "frontend/src/components/BrandsSection.tsx": "Renders a section highlighting featured automotive brands with styled cards for Turtle Wax and 3M.",
  "frontend/src/components/EmptyState.tsx": "Displays an alert-style empty state with optional action button.",
  "frontend/src/components/HomeHero.tsx": "Provides the homepage hero banner with headline text and a large background image.",
  "frontend/src/components/ProductCard.tsx": "Shows a product card with image fallback logic, wishlist/cart actions, pricing, and navigation.",
  "frontend/src/components/SiteFooter.tsx": "Renders the site footer with branding, dynamic year, and a link to caffeine.ai.",
  "frontend/src/components/SiteHeader.tsx": "Implements the responsive site header with navigation, branding, and cart/wishlist counters.",
  "frontend/src/config/branding.ts": "Defines centralized branding values like app name, slug, and tagline.",
  "frontend/src/hooks/useActor.ts": "Creates and manages authenticated or anonymous backend actors with automatic refetching on identity changes.",
  "frontend/src/hooks/useCart.ts": "Manages cart state in localStorage with item add, update, remove, and total calculation helpers.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, loading, login, logout, and identity restoration logic.",
  "frontend/src/hooks/useLocalStorageState.ts": "Custom hook syncing React state with localStorage for persistence.",
  "frontend/src/hooks/useProduct.ts": "Fetches a single product by ID using react-query and an actor API.",
  "frontend/src/hooks/useProductMutations.ts": "Provides create, update, and delete product mutations and invalidates product queries on success.",
  "frontend/src/hooks/useProducts.ts": "Fetches the full product list via react-query and the actor API.",
  "frontend/src/hooks/useWishlist.ts": "Manages wishlist items in localStorage with add, remove, toggle, and lookup helpers.",
  "frontend/src/index.css": "Defines Tailwind base styles and custom green-yellow theme variables for light and dark modes.",
  "frontend/src/lib/pricing.ts": "Utility functions for formatting INR amounts and calculating discount percentages.",
  "frontend/src/lib/productImages.ts": "Maps known brand-name product pairs to static image paths and retrieves mapped paths.",
  "frontend/src/lib/uploadedProductImages.ts": "Provides a list of uploaded product images with helpers to list paths and validate them.",
  "frontend/src/main.tsx": "Initializes React app with QueryClient and InternetIdentity providers and loads the root component.",
  "frontend/src/pages/AllProductsPage.tsx": "Displays a grid of all products with loading, error, and empty states.",
  "frontend/src/pages/CartPage.tsx": "Renders the shopping cart with quantity controls, item removal, totals, and checkout navigation.",
  "frontend/src/pages/CheckoutPage.tsx": "Handles checkout flow for single-product or cart mode with form validation and order placement.",
  "frontend/src/pages/HomePage.tsx": "Fetches products, groups them by brand, and renders hero, brand, and about sections with loading and error states.",
  "frontend/src/pages/MyProductsPage.tsx": "Provides an authenticated product management UI with create, edit, and delete dialogs and form validation.",
  "frontend/src/pages/ProductDetailsPage.tsx": "Loads a product by ID, displays details with fallback images, and supports cart and wishlist actions.",
  "frontend/src/pages/WishlistPage.tsx": "Shows wishlist items with image handling and allows moving items to the cart or viewing details.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and clearing URL and session-based parameters, including hash routing support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending typography, colors, animations, and container settings.",
  "project_state.json": "Defines project version, planned e‑commerce features, required product images, and a list of existing feature specs for catalog, checkout, and wishlist flows."
}