{
  "kind": "build_request",
  "title": "Add deployment documentation and production network configuration",
  "projectName": "Urban Wax Studio",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a clear deployment guide for deploying the app to the Internet Computer (local and mainnet), including prerequisites, build steps, deploy commands, and how to verify the deployed frontend and backend are reachable.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "Deploy"
        ]
      },
      "acceptanceCriteria": [
        "Repository contains a deployment document (e.g., README section or DEPLOYMENT.md) written in English.",
        "The guide includes local deployment steps and mainnet deployment steps (e.g., dfx start/deploy vs dfx deploy --network ic).",
        "The guide includes how to obtain and use the deployed canister URLs for the frontend and backend.",
        "Following the guide from a clean checkout results in a working local deployment (frontend loads and can call the backend) and provides complete steps for mainnet deployment."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure the frontend can be configured to point to the correct canister IDs and network (local vs ic) at build/runtime, and document the exact environment variables or configuration values that must be set for a production (ic) deployment.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "Deploy"
        ]
      },
      "acceptanceCriteria": [
        "Frontend configuration supports selecting the target network (local vs ic) without editing immutable hook files.",
        "Deployment documentation lists the exact configuration values/env vars required for an ic deployment and where they are defined (e.g., Vite env vars, generated declarations, or config module).",
        "When configured for ic, the built frontend successfully targets the ic backend canister endpoints (no hardcoded localhost assumptions)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add a simple post-deploy verification checklist that confirms core backend endpoints and critical user flows work after deployment (e.g., list products, view product details, authenticated add/update/delete from “My Products”).",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-2"
        ],
        "quotes": [
          "Deploy"
        ]
      },
      "acceptanceCriteria": [
        "Deployment docs include a post-deploy checklist covering: loading the app, fetching all products, viewing a product, and performing authenticated product mutations.",
        "Checklist includes how to log in using Internet Identity and what to expect if not authenticated (e.g., mutation calls should fail with an authorization error)."
      ]
    }
  ],
  "constraints": [
    "Keep all Motoko logic in the single backend actor (backend/main.mo).",
    "Do not edit files under frontend immutable paths (frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui).",
    "Use English for any user-facing text added by this change."
  ],
  "nonGoals": [
    "Actually performing the deployment on behalf of the user (this request should produce repo changes and instructions).",
    "Adding third-party CI/CD integrations (e.g., GitHub Actions, Vercel, Netlify).",
    "Introducing new backend services, databases, or non-IC hosting providers."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}