{
  "kind": "build_request",
  "title": "Implement requested changes (clarify scope) and finalize product image selection improvements",
  "projectName": "Urban Wax Studio",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add an in-app “Change Request” panel (accessible from the header or My Products page) that lets the user describe what changes they want, and store these requests locally in the browser so they persist across refreshes.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "I need to do changes"
        ]
      },
      "acceptanceCriteria": [
        "A user can open a Change Request panel and submit a free-text request in English.",
        "Submitted requests are saved in localStorage and are visible after page refresh.",
        "The UI provides a list of past submitted requests with timestamp and text.",
        "The UI allows deleting a saved request.",
        "All user-facing text is in English."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Ensure the “My Products” create/edit dialog fully supports three mutually exclusive product image modes—(1) choose from in-app gallery list, (2) upload from device (store as data URL in imgPath), (3) enter a custom image path—and always shows a working preview with a clear fallback image on error.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "I need to do changes"
        ]
      },
      "acceptanceCriteria": [
        "In My Products, switching between Gallery/Upload/Custom Path updates imgPath appropriately (gallery sets a default gallery image; upload clears non-data-url values; custom clears gallery/data-url values).",
        "Upload mode accepts only image/* files and rejects non-image files with an English error message.",
        "Upload mode enforces a 5MB max file size and shows an English error message when exceeded.",
        "The image preview updates immediately after selecting a gallery item, uploading a file, or typing a custom path.",
        "If the preview image fails to load, it falls back to the app’s fallback placeholder image."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Verify and (if needed) fix product image rendering across all product display surfaces (product cards, product details, cart, wishlist) so that products whose imgPath is a data URL (from device upload) render correctly without requiring backend changes.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "I need to do changes"
        ]
      },
      "acceptanceCriteria": [
        "A product whose imgPath starts with \"data:\" displays its image correctly on ProductCard, ProductDetails, Cart, and Wishlist screens.",
        "A product with an empty imgPath uses the mapped static image when available, otherwise uses the fallback placeholder.",
        "Any broken image URL (including invalid custom path) falls back to the placeholder image without crashing the page.",
        "No backend changes are required to support the above behavior."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/components/ui (compose them instead).",
    "Do not edit immutable hook files listed in SYSTEM_CONTEXT.",
    "Keep backend as a single Motoko actor in backend/main.mo; only add a migration file if a state schema change is required.",
    "Use English for all user-facing UI text."
  ],
  "nonGoals": [
    "Implementing server-side image uploads, storage, or CDN hosting for product images.",
    "Adding third-party authentication providers (only Internet Identity is allowed).",
    "Adding external databases or additional backend services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}