{
  "kind": "build_request",
  "title": "Add more products to the catalog",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-23",
      "text": "Populate the Motoko product catalog with additional products so the site shows more items on the homepage for the existing brands (\"Turtle Wax\" and \"3M\") without requiring any manual calls to addProduct.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Add products"
        ]
      },
      "acceptanceCriteria": [
        "Calling getAllProducts returns a non-empty list of products on a fresh install.",
        "The returned products include multiple items for brand \"Turtle Wax\" and multiple items for brand \"3M\" (so both brand sections render on the homepage).",
        "All seeded products have unique id values and include brand, name, shortDescription, and imgPath fields (tags optional).",
        "getAllProducts returns products sorted by id (ascending) as it does today."
      ]
    },
    {
      "id": "REQ-24",
      "text": "Ensure all newly added products render correctly in the existing UI by providing imgPath values that resolve to a valid image URL, or intentionally leaving imgPath empty so the frontend fallback image is used.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Add products"
        ]
      },
      "acceptanceCriteria": [
        "The homepage renders additional ProductCard tiles for both \"Turtle Wax\" and \"3M\" without broken image icons.",
        "If any product imgPath is empty, the ProductCard uses the existing fallback image path \"/assets/generated/product-placeholders-set.dim_1200x800.png\"."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo (no additional backend services).",
    "Do not edit files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or anything in frontend/src/components/ui."
  ],
  "nonGoals": [
    "Building an admin UI for adding/editing products.",
    "Adding new brands or new site sections beyond showing more products for the existing brands.",
    "Introducing an external database or external image hosting."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}