{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Urban Wax Studio — Deployment docs and production network configuration (frontend-only)",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add English deployment documentation for local and IC mainnet, including how to verify the deployed app is reachable.",
      "acceptanceCriteria": [
        "Repository contains a deployment document (e.g., README section or DEPLOYMENT.md) written in English.",
        "The guide includes local deployment steps and mainnet deployment steps (e.g., dfx start/deploy vs dfx deploy --network ic).",
        "The guide includes how to obtain and use the deployed canister URLs for the frontend and backend.",
        "Following the guide from a clean checkout results in a working local deployment (frontend loads and can call the backend) and provides complete steps for mainnet deployment."
      ],
      "file_operations": [
        {
          "path": "frontend/DEPLOYMENT.md",
          "operation": "create",
          "description": "Create an English deployment guide focused on the frontend developer workflow: prerequisites, local vs mainnet build/deploy commands (including the expected dfx commands), how to find canister IDs, and how to verify the frontend loads and can reach the backend canister. Include a section explaining where frontend network/canister configuration lives (ties into REQ-2)."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Make frontend network/canister targeting configurable for local vs ic via documented environment variables/config without editing immutable hook files.",
      "acceptanceCriteria": [
        "Frontend configuration supports selecting the target network (local vs ic) without editing immutable hook files.",
        "Deployment documentation lists the exact configuration values/env vars required for an ic deployment and where they are defined (e.g., Vite env vars, generated declarations, or config module).",
        "When configured for ic, the built frontend successfully targets the ic backend canister endpoints (no hardcoded localhost assumptions)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/config.ts",
          "operation": "create",
          "description": "Implement the frontend configuration module expected by frontend/src/hooks/useActor.ts (importing from '../config') by exporting createActorWithConfig that selects network (local vs ic) and correct canister IDs/hosts from Vite environment variables and safe runtime detection. Use the core-infrastructure component’s backend connection configuration conventions to build the actor config (verify the component's usage instructions before implementing). Ensure this module eliminates hardcoded localhost assumptions when configured for ic."
        },
        {
          "path": "frontend/.env",
          "operation": "modify",
          "description": "Add documented Vite environment variables for network and canister configuration (e.g., a VITE_DFX_NETWORK selector and VITE_*_CANISTER_ID values as applicable) while keeping existing branding vars. Ensure defaults remain suitable for local development and do not require editing immutable hook files."
        },
        {
          "path": "frontend/.env.production",
          "operation": "create",
          "description": "Provide a production-oriented env template for ic deployments with the exact Vite variables required to target mainnet (ic). Values can be placeholders but must match the configuration module expectations and be referenced explicitly in frontend/DEPLOYMENT.md."
        },
        {
          "path": "frontend/DEPLOYMENT.md",
          "operation": "modify",
          "description": "Document the exact environment variables/config values used by the frontend to select local vs ic and to set canister IDs/hosts, including where they are defined (frontend/.env, frontend/.env.production, and frontend/src/config.ts)."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add a post-deploy verification checklist covering key product browsing flows and authenticated product mutations via Internet Identity.",
      "acceptanceCriteria": [
        "Deployment docs include a post-deploy checklist covering: loading the app, fetching all products, viewing a product, and performing authenticated product mutations.",
        "Checklist includes how to log in using Internet Identity and what to expect if not authenticated (e.g., mutation calls should fail with an authorization error)."
      ],
      "file_operations": [
        {
          "path": "frontend/DEPLOYMENT.md",
          "operation": "modify",
          "description": "Add a post-deploy verification checklist section: confirm app loads, confirm products list loads, confirm product details page loads, and confirm authenticated flows in “My Products” (add/update/delete). Include explicit Internet Identity login steps and expected behavior when not authenticated (mutations should fail with an authorization error) and what success looks like after login."
        }
      ]
    }
  ]
}