{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Urban Wax Studio — Change Request panel + robust product image mode/preview/rendering fixes",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add an in-app Change Request panel accessible from the header and My Products that saves requests to localStorage with list + timestamps + delete.",
      "acceptanceCriteria": [
        "A user can open a Change Request panel and submit a free-text request in English.",
        "Submitted requests are saved in localStorage and are visible after page refresh.",
        "The UI provides a list of past submitted requests with timestamp and text.",
        "The UI allows deleting a saved request.",
        "All user-facing text is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/ChangeRequestPanel.tsx",
          "operation": "create",
          "description": "Create a ChangeRequestPanel component using shadcn-ui Dialog, Button, Textarea, and standard layout patterns to collect free-text requests, render a reverse-chronological list (timestamp + text), and support deleting items. Persist data via the existing useLocalStorageState hook. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/SiteHeader.tsx",
          "operation": "modify",
          "description": "Wire the ChangeRequestPanel into the header (e.g., a \"Change Request\" action/button in desktop + mobile nav) so users can open the panel from anywhere. Use shadcn-ui Button/Dialog composition and keep all labels/messages in English. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/MyProductsPage.tsx",
          "operation": "modify",
          "description": "Add an additional entry point to open the ChangeRequestPanel from the My Products page (e.g., near the page title/actions). Ensure the panel uses the same localStorage-backed data and English UI text. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Make My Products create/edit dialog fully support mutually exclusive Gallery/Upload/Custom Path image modes with correct imgPath transitions, validation, immediate preview updates, and fallback on preview error.",
      "acceptanceCriteria": [
        "In My Products, switching between Gallery/Upload/Custom Path updates imgPath appropriately (gallery sets a default gallery image; upload clears non-data-url values; custom clears gallery/data-url values).",
        "Upload mode accepts only image/* files and rejects non-image files with an English error message.",
        "Upload mode enforces a 5MB max file size and shows an English error message when exceeded.",
        "The image preview updates immediately after selecting a gallery item, uploading a file, or typing a custom path.",
        "If the preview image fails to load, it falls back to the app’s fallback placeholder image."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/MyProductsPage.tsx",
          "operation": "modify",
          "description": "Refine image-mode state handling to guarantee mutual exclusivity and the required imgPath transitions: (1) Gallery always sets imgPath to a valid default gallery image when entering gallery mode, (2) Upload always clears non-data-url values when entering upload mode and clears stale file input state, (3) Custom Path clears gallery paths and data URLs when entering custom mode. Ensure upload validation (image/* only, max 5MB) shows English errors, and that the preview updates immediately on each change and falls back to getFallbackImage() on error. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Ensure product images render correctly everywhere (cards, details, cart, wishlist) for data URLs, empty imgPath, and broken URLs using frontend-only fixes.",
      "acceptanceCriteria": [
        "A product whose imgPath starts with \"data:\" displays its image correctly on ProductCard, ProductDetails, Cart, and Wishlist screens.",
        "A product with an empty imgPath uses the mapped static image when available, otherwise uses the fallback placeholder.",
        "Any broken image URL (including invalid custom path) falls back to the placeholder image without crashing the page.",
        "No backend changes are required to support the above behavior."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/resolveProductImage.ts",
          "operation": "modify",
          "description": "Harden resolveProductImage so it reliably handles data URLs, trims whitespace, and treats empty/invalid placeholder values as missing (so mapped static image or fallback is chosen). Keep fallback pointing to the existing placeholder asset and avoid backend changes."
        },
        {
          "path": "frontend/src/components/ProductCard.tsx",
          "operation": "modify",
          "description": "Audit and adjust ProductCard image rendering to ensure data: imgPath values are passed through unchanged, empty imgPath uses resolveProductImage mapping/fallback, and any image load error reliably switches to getFallbackImage() without breaking the UI. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/ProductDetailsPage.tsx",
          "operation": "modify",
          "description": "Audit and adjust ProductDetailsPage image rendering to ensure data URLs work, empty imgPath uses mapping/fallback via resolveProductImage, and onError always swaps to getFallbackImage() safely. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/CartPage.tsx",
          "operation": "modify",
          "description": "Audit and adjust CartPage image rendering to ensure items render correctly when imgPath is a data URL, when imgPath is empty (mapped static image), and when URLs are broken (fallback placeholder via onError). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/WishlistPage.tsx",
          "operation": "modify",
          "description": "Audit and adjust WishlistPage image rendering to ensure data URLs work, empty imgPath uses mapping/fallback, and broken URLs fall back to the placeholder image without crashing. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}